{
  "common": {
    "readMore": "Czytaj dalej",
    "fillForm": "Wypełnij formularz",
    "back": "Powrót",
    "submit": "Wyślij",
    "cancel": "Anuluj",
    "save": "Zapisz",
    "edit": "Edytuj",
    "delete": "Usuń",
    "partners": "Partnerzy",
    "current": "Aktualne",
    "completed": "Zakończone",
    "experiment": "Eksperyment",
    "team": "Zespół",
    "unexpectedErrorOccured": "Wystąpił nieoczekiwany błąd",
    "polish": "Polski",
    "english": "Angielski"
  },
  "navigation": {
    "home": "Strona główna",
    "projects": "Projekty",
    "team": "Nasz Zespół",
    "achievements": "Osiągnięcia",
    "news": "Aktualności",
    "contact": "Kontakt",
    "links": "Linki"
  },
  "home": {
    "name": "Studenckie koło naukowe Politechniki Krakowskiej",
    "aboutUsDescription": "Jesteśmy grupą studentów, z różnych wydziałów, z różnymi umiejętnościami, których łączy jedno – zainteresowanie kosmosem. Działamy na Politechnice Krakowskiej od 2019 roku, mamy za sobą zrealizowane projekty i plany na realizację kolejnych. Obecnie zajmujemy się budową pierwszej rakiety sondującej, drona szybowcowego oraz projektujemy komputerową grę edukacyjną.",
    "meetOurTeam": "Poznaj nasz zespół",
    "joinCosmo": "DOŁĄCZ DO COSMO PK",
    "joinCosmoDescription": "Jeśli chcesz się przyłączyć do jednego z naszych projektów lub masz własny pomysł, wyślij nam swoje zgłoszenie – odezwiemy się do Ciebie",
    "welcome": "Witamy w Cosmic Space Organization",
    "aboutUs": "O nas",
    "ourMission": "Nasza Misja",
    "joinUs": "Dołącz do nas",
    "partners": "Nasi Partnerzy",
    "latestProjects": "Najnowsze Projekty",
    "latestNews": "Najnowsze Aktualności"
  },
  "news": {
    "moreNews": "Więcej aktualności",
    "goBack": "Powrót do aktualności",
    "author": "Autor"
  },
  "projects": {
    "allProjects": "Wszystkie projekty",
    "projectDescription": "Opis projektu",
    "mocks": {
      "rakietaTitle": "Rakieta",
      "rakietaDescription": "Projekt 'Rakieta' polega na stworzeniu rakiety z własnym silnikiem i komputerem pokładowym, umożliwiającym pełną kontrolę lotu i analizę parametrów w czasie rzeczywistym, co zwiększa bezpieczeństwo i precyzję misji.",
      "rakietaTeam": "Zespół Rakieta",
      "cosmoBotTitle": "Gra CosmoBot",
      "cosmoBotDescription": "Edukacyjna gra symulacyjna, w której gracze programują autonomiczne roboty do budowy bazy na obcej planecie. Rozwijaj umiejętności logiczne i ucz się fizyki poprzez eksplorację, wydobycie zasobów i zarządzanie zespołem robotów.",
      "cosmoBotTeam": "GameDev",
      "dronTitle": "Dron",
      "dronDescription": "Projekt drona polega na budowie statku szybowcowego, który będzie służył do obserwacji terenu i transportu ładunków, z wykorzystaniem zaawansowanych technologii i symulacji aerodynamicznych.",
      "dronTeam": "Zespół Dron",
      "habsatTitle": "HABSat oraz Cansat",
      "habsatDescription": "HABSAT to sonda stratosferyczna monitorująca atmosferę, a CANSAT to miniaturowy satelita testowany na różnych nośnikach. Oba projekty przesyłają dane w czasie rzeczywistym dzięki zaawansowanym czujnikom.",
      "habsatTeam": "OBC",
      "habsatDetailsDescriptionShort": "HABSAT to stratosferyczna sonda badawcza w standardzie cubesat, monitorująca zjawiska atmosferyczne, a CANSAT to miniaturowy satelita wielkości puszki, który może być testowany na rakietach, dronach i balonach. Oba projekty umożliwiają transmisję danych w czasie rzeczywistym dzięki zaawansowanym czujnikom i systemom komunikacyjnym.",
      "habsatDetailsMainPhotoDescription": "Zdjęcie wykonane z sondy HABsat",
      "habsatDetailsDescription": "Projekt HABSAT i CANSAT to inicjatywy mające na celu rozwój miniaturowych urządzeń badawczych przystosowanych do obserwacji atmosfery z dużych wysokości. HABSAT jest stratosferyczną sondą skonstruowaną zgodnie ze standardem cubesat, której głównym elementem jest komputer pokładowy oparty na mikrokontrolerze STM32. Wyposażona w czujniki ciśnienia, temperatury, akcelerometr oraz moduł GPS, sonda HABSAT zbiera i przekazuje dane w czasie rzeczywistym do stacji naziemnej przez protokół LoRa. CANSAT, o rozmiarach standardowej puszki, pełni podobne funkcje, lecz jego kompaktowy rozmiar pozwala na testowanie w szerokim zakresie zastosowań – od lotów balonowych po drony. Dzięki styropianowej obudowie HABSAT jest dobrze izolowany i chroniony podczas lądowania.",
      "habsatDetailsExperimentDescription": "Eksperyment z wykorzystaniem HABSAT i CANSAT obejmuje testy operacyjne i środowiskowe, podczas których sprawdzana będzie wydajność systemu komunikacji, stabilność urządzeń w różnych warunkach atmosferycznych oraz dokładność zbieranych danych. W ramach eksperymentów HABSAT zostanie wypuszczony na wysokość stratosferyczną za pomocą balonu, a CANSAT przeprowadzi testy w różnych konfiguracjach nośników, takich jak balon czy dron, w celu oceny jego uniwersalności i odporności na warunki zewnętrzne.",
      "subteamPhoto": "Zdjęcie podzespołu",
      "rakietaDetailsDescriptionShort": "Projekt 'Rakieta' polega na stworzeniu rakiety z własnym silnikiem i komputerem pokładowym, umożliwiającym pełną kontrolę lotu i analizę parametrów w czasie rzeczywistym, co zwiększa bezpieczeństwo i precyzję misji.",
      "rakietaDetailsMainPhotoDescription": "Rakieta",
      "rakietaDetailsDescription": "Projekt 'Rakieta' to ambitna inicjatywa realizowana przez nasze koło naukowe, której celem jest stworzenie zaawansowanej rakiety badawczej, zdolnej do autonomicznego lotu i monitorowania kluczowych parametrów w czasie rzeczywistym. Projekt skupia się na opracowaniu autorskiego silnika rakietowego, zasilanego paliwem stworzonym przez nasz zespół, co daje pełną kontrolę nad procesem napędowym. Pozwala to precyzyjnie dostosować charakterystykę lotu do zadań i celów misji, co jest dużym krokiem w stronę optymalizacji wydajności oraz niezawodności systemu. W obecnej wersji rakiety zastosowano zaprojektowany od podstaw komputer pokładowy na specjalnej płytce PCB wykonanej w technologii SMD. Dzięki zaprogramowaniu systemu w języku C++, komputer pokładowy umożliwia precyzyjne śledzenie parametrów lotu oraz stałą łączność radiową ze stacją bazową. Zaawansowana elektronika pokładowa pozwala dynamicznie reagować na zmienne warunki lotu, zwiększając precyzję i bezpieczeństwo przeprowadzanych misji. Po przeprowadzonych już testach silnika zespół posiada solidne podstawy do dalszego rozwoju projektu, który otwiera nowe możliwości w zakresie technologii rakietowych i badań nad autonomicznym lotem.",
      "rakietaDetailsExperimentDescription": "Eksperyment polega na przeprowadzeniu testu funkcjonalności rakiety z autorskim silnikiem i komputerem pokładowym, mającym na celu weryfikację stabilności lotu, efektywności napędu oraz możliwości monitorowania parametrów w czasie rzeczywistym. W trakcie testu zbierane będą dane dotyczące wysokości, prędkości, przyspieszenia i warunków atmosferycznych. Przeprowadzony zostanie start rakiety, podczas którego komputer pokładowy będzie analizował oraz przekazywał dane do stacji naziemnej, co pozwoli na ocenę wydajności systemu sterowania i reagowanie na zmienne warunki lotu. Na podstawie wyników eksperymentu zespół oceni, czy rakieta spełnia zakładane parametry i określi potencjalne usprawnienia w konstrukcji i oprogramowaniu.",
      "cosmoBotDetailsDescriptionShort": "Edukacyjna gra symulacyjna, w której gracze programują autonomiczne roboty do budowy bazy na obcej planecie. Rozwijaj umiejętności logiczne i ucz się fizyki poprzez eksplorację, wydobycie zasobów i zarządzanie zespołem robotów.",
      "cosmoBotDetailsMainPhotoDescription": "Grafika przedstawiająca misję kosmiczną w grze Cosmobot",
      "cosmoBotDetailsDescription": "Cosmobot to edukacyjna gra strategiczna, której celem jest nauczenie graczy przeprowadzania misji kosmicznych przy użyciu programowalnych robotów. Gracz wciela się w rolę dowódcy zespołu autonomicznych robotów, których zadaniem jest eksploracja oraz budowa bazy na obcej planecie. Aby ukończyć misje, gracze muszą programować roboty do takich zadań jak wydobycie zasobów, transport materiałów i obrona przed zagrożeniami. Cosmobot łączy naukę z rozrywką, wykorzystując mechaniki inspirowane grami takimi jak Factorio i GLADIABOTS. Gra pozwala na rozwijanie umiejętności logicznego myślenia, algorytmiki i programowania poprzez rozwiązywanie złożonych problemów i wyzwań technologicznych.",
      "cosmoBotDetailsExperimentDescription": "Eksperyment polega na testowaniu różnych scenariuszy w grze, aby zweryfikować skuteczność nauczania podstaw programowania i zarządzania zasobami w symulowanych warunkach misji kosmicznej. Gracz programuje autonomiczne roboty do realizacji zadań takich jak budowa, wydobycie i obrona bazy, a wyniki eksperymentu pozwolą określić, jak efektywnie gracze uczą się poprzez grę i jak można zwiększyć jej walory edukacyjne.",
      "cosmoBotDetailsModelsFromGame": "Modele z gry",
      "cosmoBotDetailsResources": "Wydobycie zasobów przez roboty",
      "dronDetailsDescriptionShort": "Projekt drona polega na budowie statku szybowcowego, który będzie służył do obserwacji terenu i transportu ładunków, z wykorzystaniem zaawansowanych technologii i symulacji aerodynamicznych.",
      "dronDetailsMainPhotoDescription": "Grafika przedstawiająca projekt drona",
      "dronDetailsDescription": "Projekt Dron to zaawansowana platforma szybowcowa, której celem jest przeprowadzanie obserwacji i transport ładunków. Zespół inżynierów opracowuje drona z użyciem narzędzi takich jak ANSYS Workbench i Inventor, pozwalających na symulacje aerodynamiczne i optymalizację wytrzymałości konstrukcji. Konstrukcja drona opiera się na włóknie szklanym oraz technologii druku 3D, co zapewnia lekkość i wytrzymałość. Projekt zakłada stworzenie uniwersalnej platformy, która dzięki lekkiej i wytrzymałej konstrukcji, będzie odpowiednia zarówno do misji obserwacyjnych, jak i transportowych.",
      "dronDetailsExperimentDescription": "Eksperyment polega na testowaniu miniaturowego modelu drona w celu weryfikacji założeń aerodynamicznych oraz wytrzymałościowych projektu. Model zostanie poddany serii lotów testowych, podczas których monitorowane będą takie parametry jak stabilność, nośność oraz reakcja na różne warunki atmosferyczne, co pozwoli na optymalizację projektu pełnowymiarowego drona.",
      "dronDetails3dPrint": "Wydrukowana za pomoca druku 3D część drona"
    }
  },
  "footer": {
    "address": "Adres",
    "contactUs": "Skontaktuj się z nami",
    "followUs": "Śledź nas",
    "allRightsReserved": "Wszelkie prawa zastrzeżone"
  }
}
